app/views/messages/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
	                  <td><%= index + 1 %></td>
	                  <td><%= User.find(message.recipient_id).email%></td>