app/views/messages/new.html.erb

SELECT "users".* FROM "users" WHERE "users"."role" = ?  [["role", "user"]]
---
                      <label>Reciever's Trainer</label>
                      <%= f.collection_select :recipient_id, User.where(:role => "trainer").all, :id, :email, {}, {:class => "form-control"} %>