app/views/messages/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
            </div>
            <p><%= User.find(@message.sender_id).email %></p>