app/controllers/messages_controller.rb

def index

	@messages = Message.where(:sender_id => current_user.id).or(Message.where(:recipient_id => current_user.id))
---
SELECT "messages".* FROM "messages" WHERE ("messages"."sender_id" = ? OR "messages"."recipient_id" = ?)  [["sender_id", 3], ["recipient_id", 3]]

def create
	@message = Message.new(message_params)
	@message.sender_id = current_user.id
      respond_to do |format|
			if @message.save
---
INSERT INTO "messages" ("sender_id", "recipient_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["sender_id", 4], ["recipient_id", 3], ["body", "sdcsdfvfwe"], ["created_at", "2018-04-05 05:43:47.511292"], ["updated_at", "2018-04-05 05:43:47.511292"]]

    def set_message
        @message = Message.find(params[:id]) if params[:id]
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]